Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official STM32F429I-DISCO.c

enum {
//*=default , +=alternate
//PIN    |BOARD LABEL                      |I2C1|I2C2|I2C3|SPI1 |SPI2 |SPI3 |SPI4 |SPI5 |SPI6 |USART1|USART2|USART3|USART6|ADC1 |TIM (PWM)                                 |USB       |SDIO|RCC       |SYS        
PA0 , // |B1 [Blue PushButton]             |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN0 |*TIM2_CH1 *TIM5_CH1                       |          |    |          |           
PA1 , // |MEMS_INT1 [L3GD20_INT1]          |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN1 |*TIM2_CH2 *TIM5_CH2                       |          |    |          |           
PA2 , // |MEMS_INT2 [L3GD20_INT2]          |    |    |    |     |     |     |     |     |     |      |*TX   |      |      |*IN2 |+TIM9_CH1 *TIM2_CH3 *TIM5_CH3             |          |    |          |           
PA3 , // |B5                               |    |    |    |     |     |     |     |     |     |      |*RX   |      |      |*IN3 |*TIM2_CH4 *TIM5_CH4 +TIM9_CH2             |          |    |          |           
PA4 , // |VSYNC                            |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN4 |                                          |          |    |          |           
PA5 , // |                                 |    |    |    |*SCK |     |     |     |     |     |      |      |      |      |*IN5 |*TIM8_CH1N +TIM2_CH1                      |          |    |          |           
PA6 , // |G2                               |    |    |    |*MISO|     |     |     |     |     |      |      |      |      |*IN6 |*TIM3_CH1 +TIM13_CH1                      |          |    |          |           
PA7 , // |ACP_RST                          |    |    |    |*MOSI|     |     |     |     |     |      |      |      |      |*IN7 |+TIM8_CH1N +TIM14_CH1 *TIM3_CH2 *TIM1_CH1N|          |    |          |           
PA8 , // |I2C3_SCL [ACP/RF_SCL]            |    |    |*SCL|     |     |     |     |     |     |      |      |      |      |     |+TIM1_CH1                                 |          |    |          |           
PA9 , // |                                 |    |    |    |     |     |     |     |     |     |*TX   |      |      |      |     |+TIM1_CH2                                 |          |    |          |           
PA10, // |                                 |    |    |    |     |     |     |     |     |     |*RX   |      |      |      |     |+TIM1_CH3                                 |          |    |          |           
PA11, // |R4                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM1_CH4                                 |*OTG_FS_DM|    |          |           
PA12, // |R5                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |*OTG_FS_DP|    |          |           
PA13, // |SWDIO                            |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |*JTMS-SWDIO
PA14, // |SWCLK                            |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |*JTCK-SWCLK
PA15, // |TP_INT1 [Touch Panel]            |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM2_CH1                                 |          |    |          |*JTDI      
PB0 , // |R3                               |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN8 |*TIM8_CH2N *TIM3_CH3 *TIM1_CH2N           |          |    |          |           
PB1 , // |R6                               |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN9 |*TIM3_CH4 *TIM1_CH3N *TIM8_CH3N           |          |    |          |           
PB2 , // |BOOT1                            |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PB3 , // |                                 |    |    |    |+SCK |     |+SCK |     |     |     |      |      |      |      |     |+TIM2_CH2                                 |          |    |          |*JTDO-SWO  
PB4 , // |                                 |    |    |    |+MISO|     |+MISO|     |     |     |      |      |      |      |     |+TIM3_CH1                                 |          |    |          |*JTRST     
PB5 , // |SDCKE1                           |    |    |    |+MOSI|     |+MOSI|     |     |     |      |      |      |      |     |+TIM3_CH2                                 |          |    |          |           
PB6 , // |SDNE1 [SDRAM_CS]                 |*SCL|    |    |     |     |     |     |     |     |+TX   |      |      |      |     |+TIM4_CH1                                 |          |    |          |           
PB7 , // |                                 |*SDA|    |    |     |     |     |     |     |     |+RX   |      |      |      |     |+TIM4_CH2                                 |          |    |          |           
PB8 , // |B6                               |+SCL|    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM10_CH1 +TIM4_CH3                      |          |*D4 |          |           
PB9 , // |B7                               |+SDA|    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM11_CH1 +TIM4_CH4                      |          |*D5 |          |           
PB10, // |G4                               |    |+SCL|    |     |*SCK |     |     |     |     |      |      |*TX   |      |     |+TIM2_CH3                                 |          |    |          |           
PB11, // |G5                               |    |+SDA|    |     |     |     |     |     |     |      |      |*RX   |      |     |+TIM2_CH4                                 |          |    |          |           
PB12, // |OTG_FS_ID                        |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PB13, // |VBUS_FS                          |    |    |    |     |+SCK |     |     |     |     |      |      |      |      |     |+TIM1_CH1N                                |          |    |          |           
PB14, // |OTG_FS_DM                        |    |    |    |     |+MISO|     |     |     |     |      |      |      |      |     |*TIM12_CH1 +TIM8_CH2N +TIM1_CH2N          |*OTG_HS_DM|    |          |           
PB15, // |OTG_FS_DP                        |    |    |    |     |+MOSI|     |     |     |     |      |      |      |      |     |*TIM12_CH2 +TIM1_CH3N +TIM8_CH3N          |*OTG_HS_DP|    |          |           
PC0 , // |SDNWE                            |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN10|                                          |          |    |          |           
PC1 , // |NCS_MEMS_SPI [L3GD20_CS_I2C/SPI] |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN11|                                          |          |    |          |           
PC2 , // |CSX [LCD-RGB_CSX]                |    |    |    |     |*MISO|     |     |     |     |      |      |      |      |*IN12|                                          |          |    |          |           
PC3 , // |                                 |    |    |    |     |*MOSI|     |     |     |     |      |      |      |      |*IN13|                                          |          |    |          |           
PC4 , // |OTG_FS_PSO [OTG_FS_PowerSwitchOn]|    |    |    |     |     |     |     |     |     |      |      |      |      |*IN14|                                          |          |    |          |           
PC5 , // |OTG_FS_OC [OTG_FS_OverCurrent]   |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN15|                                          |          |    |          |           
PC6 , // |HSYNC                            |    |    |    |     |     |     |     |     |     |      |      |      |*TX   |     |*TIM8_CH1 +TIM3_CH1                       |          |*D6 |          |           
PC7 , // |G6                               |    |    |    |     |     |     |     |     |     |      |      |      |*RX   |     |*TIM8_CH2 +TIM3_CH2                       |          |*D7 |          |           
PC8 , // |                                 |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM8_CH3 +TIM3_CH3                       |          |*D0 |          |           
PC9 , // |I2C3_SDA [ACP/RF_SDA]            |    |    |*SDA|     |     |     |     |     |     |      |      |      |      |     |*TIM8_CH4 +TIM3_CH4                       |          |*D1 |          |           
PC10, // |R2                               |    |    |    |     |     |*SCK |     |     |     |      |      |+TX   |      |     |                                          |          |*D2 |          |           
PC11, // |                                 |    |    |    |     |     |*MISO|     |     |     |      |      |+RX   |      |     |                                          |          |*D3 |          |           
PC12, // |                                 |    |    |    |     |     |*MOSI|     |     |     |      |      |      |      |     |                                          |          |*CK |          |           
PC13, // |                                 |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PC14, // |PC14-OSC32_IN                    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |*OSC32_IN |           
PC15, // |PC15-OSC32_OUT                   |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |*OSC32_OUT|           
PD0 , // |D2                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD1 , // |D3                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD2 , // |                                 |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |*CMD|          |           
PD3 , // |G7                               |    |    |    |     |+SCK |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD4 , // |                                 |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD5 , // |                                 |    |    |    |     |     |     |     |     |     |      |+TX   |      |      |     |                                          |          |    |          |           
PD6 , // |B2                               |    |    |    |     |     |+MOSI|     |     |     |      |+RX   |      |      |     |                                          |          |    |          |           
PD7 , // |                                 |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD8 , // |D13                              |    |    |    |     |     |     |     |     |     |      |      |+TX   |      |     |                                          |          |    |          |           
PD9 , // |D14                              |    |    |    |     |     |     |     |     |     |      |      |+RX   |      |     |                                          |          |    |          |           
PD10, // |D15                              |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD11, // |TE [LCD-RGB_TE]                  |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD12, // |RDX [LDC-RGB_RDX]                |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM4_CH1                                 |          |    |          |           
PD13, // |WRX_DCX [LCD-RGB_WRX_DCX]        |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM4_CH2                                 |          |    |          |           
PD14, // |D0                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM4_CH3                                 |          |    |          |           
PD15, // |D1                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM4_CH4                                 |          |    |          |           
PE0 , // |NBL0 [SDRAM_LDQM]                |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PE1 , // |NBL1 [SDRAM_UDQM]                |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PE2 , // |                                 |    |    |    |     |     |     |*SCK |     |     |      |      |      |      |     |                                          |          |    |          |*TRACECLK  
PE3 , // |                                 |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |*TRACED0   
PE4 , // |                                 |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |*TRACED1   
PE5 , // |                                 |    |    |    |     |     |     |*MISO|     |     |      |      |      |      |     |*TIM9_CH1                                 |          |    |          |*TRACED2   
PE6 , // |                                 |    |    |    |     |     |     |*MOSI|     |     |      |      |      |      |     |*TIM9_CH2                                 |          |    |          |*TRACED3   
PE7 , // |D4                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PE8 , // |D5                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM1_CH1N                                |          |    |          |           
PE9 , // |D6                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM1_CH1                                 |          |    |          |           
PE10, // |D7                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM1_CH2N                                |          |    |          |           
PE11, // |D8                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM1_CH2                                 |          |    |          |           
PE12, // |D9                               |    |    |    |     |     |     |+SCK |     |     |      |      |      |      |     |+TIM1_CH3N                                |          |    |          |           
PE13, // |D10                              |    |    |    |     |     |     |+MISO|     |     |      |      |      |      |     |*TIM1_CH3                                 |          |    |          |           
PE14, // |D11                              |    |    |    |     |     |     |+MOSI|     |     |      |      |      |      |     |*TIM1_CH4                                 |          |    |          |           
PE15, // |D12                              |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF0 , // |A0                               |    |*SDA|    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF1 , // |A1                               |    |*SCL|    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF2 , // |A2                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF3 , // |A3                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF4 , // |A4                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF5 , // |A5                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF6 , // |                                 |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM10_CH1                                |          |    |          |           
PF7 , // |SPI5_SCK [L3GD20_SCL/SPC]        |    |    |    |     |     |     |     |*SCK |     |      |      |      |      |     |*TIM11_CH1                                |          |    |          |           
PF8 , // |SPI5_MISO [L3GD20_SDO]           |    |    |    |     |     |     |     |*MISO|     |      |      |      |      |     |*TIM13_CH1                                |          |    |          |           
PF9 , // |SPI5_MOSI [L3GD20_SDA/SDI/SDO]   |    |    |    |     |     |     |     |*MOSI|     |      |      |      |      |     |*TIM14_CH1                                |          |    |          |           
PF10, // |ENABLE [LCD-RGB_ENABLE]          |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF11, // |SDNRAS                           |    |    |    |     |     |     |     |+MOSI|     |      |      |      |      |     |                                          |          |    |          |           
PF12, // |A6                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF13, // |A7                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF14, // |A8                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF15, // |A9                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG0 , // |A10                              |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG1 , // |A11                              |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG2 , // |                                 |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG3 , // |                                 |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG4 , // |BA0                              |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG5 , // |BA1                              |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG6 , // |R7                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG7 , // |DOTCLK [LCT-RGB_DOTCLK]          |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG8 , // |SDCLK                            |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG9 , // |                                 |    |    |    |     |     |     |     |     |     |      |      |      |+RX   |     |                                          |          |    |          |           
PG10, // |G3                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG11, // |B3                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG12, // |B4                               |    |    |    |     |     |     |     |     |*MISO|      |      |      |      |     |                                          |          |    |          |           
PG13, // |LD3 [Green Led]                  |    |    |    |     |     |     |     |     |*SCK |      |      |      |      |     |                                          |          |    |          |           
PG14, // |LD4 [Red Led]                    |    |    |    |     |     |     |     |     |*MOSI|      |      |      |+TX   |     |                                          |          |    |          |           
PG15, // |SDNCAS                           |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
